{"inkVersion":20,"root":[[{"->":"Main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Main":[["^Ah, detective. You came that early? Would you like a drink? ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n",["ev",{"^->":"Main.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^I don't drink on duty. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Main.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Maybe later. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Come on, detective. Don't you need some relaxation?","\n",["ev","str","^No all I need is information","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Yes, you're right","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ What I need right now is for you, Miss Vagie, to share your knowledge with me.","\n","^Understood. I'll continue with my enjoyment alone then.. sighs","\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["^ You're right. But it would be much better if I have my wits about me, ma'am.","\n","^Alright, as much as I'd like to, I can't force you, Mr. Marvin. _sighs_","\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["ev",{"^->":"Main.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^I'm concerned that later will never come.","\n",["ev","str","^You're right","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Perhaps when all of this is done","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^By the time my mission is over, we'll probably have reached my stop. ","\n","^Such a shame you're missing out on the chance to drink with me.","\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["^Perhaps when all of this is done if you can prove to me that you're innocent, I can buy you a light drink. ","\n","^_Laughs_ I'm not really into light things, but I guess I'll make an exception this time.","\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"g-0":["^Alright, then I have a few questions to ask.","\n",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"^Sure, please don't hesitate. I'm all ears. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","^Vagie Delano. 27 years old. From the Viv'od people. Bartender. ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","^Yes. It's me.  ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^VIP Ticket","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Where are you going?","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["^ Do you always travel in VIP? ","\n","^Yes, sir, the company pays for my fare. *Winks*","\n",[["ev",{"^->":"Main.0.g-0.c-2.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Where do you work?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-0.c-2.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^I work at a small bar in a big company, but I guess I have a devilish charm. My boss really likes me.","\n",["ev","str","^You are really important for them.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^You must be someone important in the company for a bartender. ","\n","^I can say that, yes.","\n",{"->":"Main.0.g-1"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-3":["^ May I ask where you're heading?","\n","^Dilia 8I2 planet. I still have two stops ahead.","\n",[["ev",{"^->":"Main.0.g-0.c-3.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Why?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-0.c-3.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Work.","\n",{"->":"Main.0.g-1"},{"#f":5}]}],{"#f":5}],"#f":5}],"g-1":["^Alright, what can you tell me about last night? ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","^Actually, nothing. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^Such a pity","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^You're not being helpful","/str","/ev",{"*":".^.c-5","flg":20},{"c-4":["^ I thought you could be more helpful, Ms. Vagie. Maybe then I would have an excuse to thank you later.","\n","^I would have loved to, but nothing noteworthy happened, really.","\n",["ev","str","^Did you know the victim?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Was there something between you and the victim?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Have you met Mr. Quill before? ","\n","^No. But I know those types. Serious, well-dressed, respectable, but fundamentally flawed, an bastard. Based on my experiences, I can say he was a selfish, egotistical person. If you ask me, he must have hurt someone who crossed his path, and karma caught up with him. You can trust my judgments about people. Plus, he was the owner of an important company. I'm sure he had plenty of enemies.","\n",["ev","str","^Did this situation upset you?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Did the fact that a murder was committed on the train upset you?","\n","^I don't understand.","\n",["ev","str","^I'll repeat","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ I asked a straightforward question, Miss Vagie, let me repeat it. Did it upset you that a murder was committed on the train? ","\n","^I haven't considered it from that angle. No, I can't say that it upset me.","\n",["ev","str","^Hm...","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ So, murder is just a normal, ordinary occurrence for you? ","\n","^Of course, it's not pleasant. What I meant to say is, there was no emotional connection between Mr. Quill and me. His death doesn't mean anything to me.","\n",["ev","str","^You're a logical person","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Despite appearing fun and emotional, you're fundamentally a logical person, right?","\n","^I'm afraid I won't be throwing tantrums like Mr. Cisco to prove that I'm sensitive. After all, people die every day.","\n",{"->":"Main.0.g-2"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-1":["^ I'm aware of the closeness you had with Mr. Quill throughout the evening, just like everyone else. Was there a relationship between you? ","\n","^What kind of accusation is that! Of course not. I was with Mr. Quill the way I am with you, detective. Please be mindful of the boundaries in your questions. I don't want to discuss this matter any further. Good evening.","\n",[["ev",{"^->":"Main.0.g-1.c-4.4.c-1.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^This is an investigation, you can't escape like this. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-1.c-4.4.c-1.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^This doesn't even qualify as an official case at the moment. I prefer to give my statement to real police officers at the first station. Please don't bother me anymore.","\n","done",{"->":"Main.0.g-2"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-5":["^ Miss Vagie, I understand that you're trying to be  helpfull, but I must admit it's not working at all. I'm asking you to push yourself a little more. Has anything significant happened?\"","\n","^_Exhales_ Detective, I'm sure everyone in that room would give the same answer. Nothing suspicious or unusual happened. Look, you can see me however you want, but I'm not a foolish woman. I'm aware that I'm a suspect in this case, and I'll do my best to defend myself, but there was no incident that I could bring forward. Everyone was very friendly.","\n",["ev","str","^I believe your words","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You don't see anyone else besides Quill","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ This is not an accusation, Miss Vagie. It's an investigation. Everyone is a suspect, but that doesn't make everyone a killer. I'm sure there are things you've overlooked. I believe it's not because you're hiding them, but because you don't remember. ","\n","^Thank you, Mr. Marvin. I truly am trying to help as much as I can, but we drank all night, and my memory is not very clear.","\n",{"->":"Main.0.g-2"},{"#f":5}],"c-1":["^ Maybe it's because no one else mattered to you that evening except Mr. Quill. Yes, you're not a foolish woman, but that doesn't make you innocent either. Mr. Quill was a wealthy man, and you were aware of that. So your attention was focused on Mr. Quill throughout the night. ","\n","^What kind of accusation is this! There was no special relationship between Mr. Quill and me! Moreover, I think it's highly inappropriate for you to imply such things and you should know the limits of decency. That's all I have to say to you! I don't want to discuss this matter any further. Good evening.","\n",[["ev",{"^->":"Main.0.g-1.c-5.4.c-1.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^This is an investigation, you can't escape like this. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-1.c-5.4.c-1.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^This doesn't even qualify as an official case at the moment. I prefer to give my statement to real police officers at the first station. Please don't bother me anymore.","\n","done",{"->":"Main.0.g-2"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5}],"g-2":["^So then, ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","ev","str","^About other people","/str","/ev",{"*":".^.c-6","flg":20},{"c-6":["^ Alright. Who else did you know at the party? Have you met any of them before?","\n",{"->":"Main.0.g-3"},{"#f":5}],"#f":5}],"g-3":["^I might have seen Mr. Ajax and Mr. Urit a couple of times. I didn't share the same table with any of them. I met everyone for the first time on this journey. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^Impressions of the individuals","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":["^ I assume you got to know people to some extent throughout the evening. What are your general impressions of them? ","\n",{"->":"Main.0.g-4"},{"#f":5}],"#f":5}],"g-4":["^Hmm. Let me think. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^Mr. Urit","/str","/ev",{"*":".^.c-8","flg":20},{"c-8":["^ ","\n","^Mr. Urit is a fun personality. I can say he kept us entertained throughout the evening. He may appear carefree and reckless, but I'm sure he's not really like that. I can bet there's more to him than meets the eye. I've heard a few things about him before. Most of it revolves around him being a ladies' man. You know pilots. Their eyes are always searching for fun and new adventures. He might come off a bit brash at first, but as time goes by, you'll get used to him, and maybe even invite him to your table every time you board the ship.","\n",["ev","str","^Mr. Ajax","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ The doctor, right? Ah, he's a very warm and friendly person. His room is right next to mine, so I saw firsthand how concerned he was when he rushed out of his room upon learning about Mr. Quill's incident. Detective, I can't say for sure who did it, but I can guarantee that tonight Mr. Ajax genuinely tried to save that man. I don't know, if he did kill him, he might have tried to help out of guilt or to avoid getting caught, but he definitely made an effort.\"","\n",["ev","str","^Mr. Cisco","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Mr. Cisco... A sweet man. And quite talented too. He brought a violin specifically for us and continued playing in the room. Fortunately, the room was far enough from you, so you weren't disturbed. He has an amazing ear for music. He also writes his own compositions, although most of them are eerie tunes. Sometimes he can be unsettling. You've seen him yourself. He has a tendency to be imaginative and obsessive. Maybe he has a condition. He's overly anxious and fretful, and it seems to have worsened after this incident. Have you talked to him? Oh my, he's truly terrified. He believes each one of us will be killed one by one and that something needs to be done urgently. If I were in your place, I would talk to him as soon as possible because he looks like he could faint at any moment.","\n",["ev","str","^Mr. Goris","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Ah, Velkor. Believe me, if I hadn't met Mr. Urit, I would have thought that the people of Velkor are cold and unwelcoming. I guess it's because he's a retired colonel. He's a bit tense. I don't know, they kept arguing about the War of Ez between Velkor and Coltrane throughout the evening. It's a war that happened centuries ago. Men... Of course, it's not a reason to kill someone, but... Mr. Urit didn't seem too happy when he left the room. He appeared angry. Besides, as you know, the rooms are very close to each other. I'm not saying he did it, but... We should consider that he's a former soldier. Mr. Urit is a more nationalist person than he should be. And you know what they say. Once a murderer, always a murderer. I'm sure he has killed many people as a soldier. It must have become second nature to him. Anyway, this is not an accusation. Please don't misunderstand.","\n",{"->":"Main.0.g-5"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5}],"g-5":["^Can you summarize what happened after I left? Try not to miss any details, if possible. ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","^We went to Mr. Quill's room. He offered us his special drink, Milky Eclipse, which he carried in his suitcase and only took out occasionally. It's a type of liquor unique to his country. Mr. Goris initially refused to drink it, but he tried it later. He didn't show it, but it was evident that he liked it a lot. It was a beautiful drink, because you can consider this a professional opinion coming from a bartender. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^About Mr. Goris","/str","/ev",{"*":".^.c-9","flg":20},["ev",{"^->":"Main.0.g-5.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-10","flg":18},{"s":["^Why did he offer a special drink?",{"->":"$r","var":true},null]}],{"c-9":["^ Do you have any idea why Mr. Goris agreed to come to the room if he didn't get along with Mr. Quill? ","\n","^I think Mr. Goris and Mr. Urit knew each other before. But I don't know the details. And he tried the drink because of Mr. Urit's insistence. If the co-pilot hadn't been there, Mr. Goris probably would have declined to join us from the beginning by not coming to the table.","\n",{"->":"Main.0.g-6"},{"#f":5}],"c-10":["ev",{"^->":"Main.0.g-5.c-10.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","^I honestly have no clue about that. I think the relaxed atmosphere resulting from us having a few drinks earlier and the enjoyable conversation made him feel close to us. Or maybe he just wanted to show off with what he had at hand.","\n",{"->":"Main.0.g-6"},{"#f":5}],"#f":5}],"g-6":["^Please continue. ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","^We talked about our work, where we come from and where we're heading, but those were just surface-level answers. If you ask the others after me, they will probably give you the same answers.",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^Did anyone leave the room?","/str","/ev",{"*":".^.c-11","flg":20},"ev","str","^Thoughts on Mr. Quill's profession.","/str","/ev",{"*":".^.c-12","flg":20},{"c-11":["^ Did anyone leave your side during the party or retire to their room early?","\n","^Mr. Cisco stepped out only for a few minutes. It wasn't something significant. He had praised his own composition so much that I wanted to hear it. He didn't actually intend to play, but I persuaded him a bit, and reluctantly, he had to bring his violin.","\n",[["ev",{"^->":"Main.0.g-6.c-11.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^How long was he gone for? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-6.c-11.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^It didn't take long. That's how I remember it. I can't give you an exact time because I was engrossed in conversation. Apart from that, we all dispersed at the same time.","\n",{"->":"Main.0.g-7"},{"#f":5}]}],{"#f":5}],"c-12":["^ What do you think about Mr. Quill and his profession?","\n","^Honestly, I can't say we had a very detailed conversation. He just kept boasting about the sales. I guess his latest strategic move was successful, which led to an increase in stock prices. Well, at least I can say that Mr. Quill is a successful businessman. But if I knew a lot about business, I wouldn't be a bartender. *Laughs*","\n",{"->":"Main.0.g-7"},{"#f":5}],"#f":5}],"g-7":["^After a few drinks, Mr. Cisco gave us a small violin recital. I don't know if you consider it an important detail, but I must admit that I danced with Mr. Quill for a few minutes. Then we all went to our rooms. I think Mr. Ajax accompanied me to my room because I had drunk so much that I could barely stand. I should thank him for his kindness later, if the killer doesn't emerge *laughs*. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","ev","str","^Why did you choose the room at the beginning of the corridor?","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Regarding Mr. Ajax accompanying you to your room","/str","/ev",{"*":".^.c-14","flg":20},{"c-13":["^ Was there a specific reason for choosing the room at the beginning of the corridor?","\n","^Actually, there is. The room closest to the bar is the best room. Because I usually drink a lot and have trouble finding my room. Once I accidentally entered another guest's room. I have a habit of barging into the first available room I come across. So I try to keep my room as close as possible.","\n",{"->":"Main.0.g-8"},{"#f":5}],"c-14":["^ Did you have any conversation with Mr. Ajax after he accompanied you to your room? How long did he stay with you? ","\n","^He didn't stay long at all. After my half-hearted gratitude, he politely wished me good night and left. I threw myself into bed.","\n",{"->":"Main.0.g-8"},{"#f":5}],"#f":5}],"g-8":["^I'm sorry, but those are all the things I remember. As you can understand from my profession, I have a good relationship with alcohol, and I drank too much last night. My memory is still fuzzy, and I almost have a splitting headache. Maybe I should visit the doctor and get some painkillers.",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","^Thank you, Ms. Vagie. You've been very helpful. I'll kindly ask you to stay here until I finish examining your room. I regret to inform you that you cannot enter your room until I'm done with my work.  ",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","^No problem, Detective. I guess that's how things go. I hope you find the killer as soon as possible. ",{"#":"speaker: Barmen"},{"#":"portrait:Barmen"},"\n","^If Ms. Vagie has such suspicions about Mr. Goris, it would be beneficial to talk to him as well.",{"#":"speaker: Dedective"},{"#":"portrait:Dedective"},"\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}