{"inkVersion":20,"root":[[{"->":"Main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Main":[["^Good evening, young man. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","^De: Good evening, Colonel. ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: I'm listening. I believe you have a few questions to ask. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","ev","str","^Yes, sir.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ First, may I have some information about yourself? ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Goris Urken. Retired Colonel, and I'm from the Velkor race. I'm sure you already knew that.","\n",[["ev",{"^->":"Main.0.c-0.6.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Yes, of course. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.c-0.6.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: I come from the planet Odroth. It's where my people live.","\n",["ev","str","^Distance","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Isn't that quite far from the Astro Express departure point? ","\n","^Go: Indeed it is. I had to make three transfers.","\n",[["ev",{"^->":"Main.0.c-0.6.c-0.11.c-0.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Where are you heading, then? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.c-0.6.c-0.11.c-0.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Go: To Meverilia. I want to enjoy my retirement now.","\n",["ev","str","^Military Ship","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ But you haven't boarded a military ship. As far as I know, there's a service specifically for retired soldiers. ","\n",["ev","str","^Why?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ May I ask why you specifically chose this flight route? ","\n","^I chose Astro Express for some personal reasons.","\n",["ev","str","^Realize the seriousness of the situation","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^This is not relevant","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ Mr. Goris, you must realize that the situation we're in is quite serious. You don't have the luxury of keeping such information from me. ","\n","^Speak as if you are aware that you're talking to a Colonel, young man. I am a valued Velkor who fought for Odrorth for years.","\n",["ev","str","^You're right","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ You're right, sir, but please try to assist me, if you can. ","\n","^Alright, I understand that you're trying to do your job. So, I'll overlook it for now. Urit is the son of a former comrade of mine. Sciqi Aalot was one of the most skilled combat pilots in my platoon. Urit was a young man who carried the same light. Atik is a smart and quick-reflexed kid. However, I didn't have a chance to meet him after his father's plane crash. That's why I chose this flight to see him one last time.","\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["^ This situation has nothing to do with the horrific incident that took place. I need to evaluate all of you from an objective perspective. So, please continue speaking while keeping that in mind. ","\n","^You can approach this respectfully and objectively. Being neutral or doing your job doesn't prevent you from showing respect to someone older and more experienced.","\n",["ev","str","^You're right","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ I understand you, Colonel. Let's leave this unpleasant tension behind and continue our conversation. What was the reason for choosing this flight? What business did you have at the table? ","\n","^I know Urit from the past. I stopped by to say hello to him. That was my personal reason as well.","\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"g-0":["^Alright, let's talk a bit about Mr. Quill now. ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: I heard that slimy snake has been killed, that unpleasant-faced snake. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","^De: Have you ever been to the planet you planned to go to before? Go: I've been there a few times for business.",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^De: Meverilia is where Xander Holding's headquarters is located. Have you had the opportunity to meet Mr. Quill before, or is this your first encounter? ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: No, I haven't met him. I'm seeing Mr. Quill for the first time on Astro Express. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","^De: Well, I'm curious about what you've learned about him so far. For example, did you know which planet he was going to? ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: No? If you want to know that, it's probably written on his ticket. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","^De: He's going to the planet Lualara. For business purposes. ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: Well, good for him, I guess. ",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n",["ev",{"^->":"Main.0.g-0.36.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Why do you think so?",{"->":"$r","var":true},null]}],"ev","str","^Do you hate Mr. Quill this much?","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["ev",{"^->":"Main.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.36.s"},[{"#n":"$r2"}],"\n","^I don't like people who boast about their job and constantly consider themselves superior to others. That Snake-man named Quill was one of them. Moreover, I heard that not many people in his own company liked him. I believe a few people died because of his irresponsibility, but of course, that's not solid evidence. Well, these are enough reasons for me to dislike scum like him. I think he got what he deserved.","\n",{"->":"Main.0.g-1"},{"#f":5}],"c-2":["^ Yes. Selfish jerks like him shouldn't have the right to live. And when his race is already poisoning our universe enough, powerful and wealthy bastards like him shouldn't be alive either. ","\n",["ev","str","^You're being rude, that makes you suspicious.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You still shouldn't speak like that.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^You may be right.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ You don't have the right to talk like this about a dead man. It only makes you even more suspicious. Do you know how many murders have been committed out of hatred? ","\n","^You can't be crazy enough to accuse me of being a shallow person who would commit murder, can you? Right? I'm answering all of this out of formality. I will ask for a man from the Velkor consulate at the first stop. I will also mention the disgraceful treatment I have received. ","done","\n",{"->":"Main.0.g-1"},{"#f":5}],"c-1":["\n",{"->":"Main.0.g-1"},{"#f":5}],"c-2":["^ ","\n",{"->":"Main.0.g-1"},{"#f":5}]}],{"#f":5}],"#f":5}],"g-1":["^Okay, can you tell me what happened after me? Can you talk about it a bit?",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: I can't say much. The Viv'od woman spent time with that snake-faced man. The pathetic musician tried to impress that woman all night. The doctor, Urit, and I had a conversation. He offered us drinks at one point. I won't hesitate to say that it might be the most disgusting thing I've ever put in my mouth. And I'm a soldier, detective, I've worked in the field for years. I've eaten things that would disgust many people just to survive, but believe me, this was the worst.",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","ev","str","^Musician","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Quill and Vagie relationship","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["^ Ms. Vagie mentioned at one point that Mr. Cisco had left the room. Does anything about that seem suspicious to you? ","\n","^Honestly, the musician has been a suspicious person to me from the beginning. I've seen such weak and pathetic people before. They're never what they appear to be on the surface. I caught him looking at the Snake-faced guy from time to time. I thought it was out of jealousy, but I'm not sure. I can't say for certain why he left the room; maybe his only purpose was to play the violin for us, but I'd take it with a pinch of salt.","\n",{"->":"Main.0.g-2"},{"#f":5}],"c-4":["^ ","\n","^There are some women whose taste in men I will never understand. Vagie is a beautiful and attractive woman. I can't deny that. But why would she spend the whole night with the Snake-faced guy and the musician when she has a real man like Urit or a doctor around? Quill has money, that's for sure. But there are things about the musician that don't sit right with me.","\n",{"->":"Main.0.g-2"},{"#f":5}],"#f":5}],"g-2":["^Do you have any other moments from the evening? ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: That's about it. I won't lie, it's true that Quill and I argued from time to time. But neither he nor I crossed the boundaries of respect. From what I saw among the others, there was no tension either. Although I spent most of my night with Urit. We had a lot to talk about.",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n","^De: At what time did you disperse? What did you do afterwards?",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","^Go: We all left at the same time. I don't know if anyone went to his room afterwards, but when I left, everyone had already left the room. The doctor took Vagie to her room. I went to my own room. I sat down and read a book for a while, then went to bed. But soon after, I heard a noise outside.",{"#":"speaker: Colonel"},{"#":"portrait: Colonel"},"\n",["ev",{"^->":"Main.0.g-2.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^Did you hear anything while you were awake? ",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"Main.0.g-2.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n","^No, I didn't. My ears are sharp. It comes with being a soldier. I'm good at sensing danger. But there was no activity in the corridor after the doctor returned to his room until","\n",[["ev",{"^->":"Main.0.g-2.c-5.9.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^What do you think happened during that time? What are your professional opinions? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-2.c-5.9.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^If we assume that no one passed by while I was asleep, then something must have happened while we were inside. That would definitely make one of us the killer. Of course, if it's a murder.","\n",["ev","str","^I didn't mention if it was a murder","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^In your opinion, what could be the cause of death?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^It may not be. I just thought that if we focus on this possibility, that's how the situation stands. Remember, if it's a murder, it would likely come from the quietest and least expected person. That's how these things work. There were plenty of traitors in the military. Usually, it's the ones you trust the most, those closest to you, or the most unexpected ones.","\n",{"->":"Main.0.g-3"},{"#f":5}],"c-1":["^ ","\n","^If no one entered the room afterwards, I think it could be poison. If you can't physically kill someone, you leave that job to someone who can. And since there are types of poisons that don't act immediately, it makes it harder to be discovered. Perhaps they wanted to buy time until the next planet.","\n",{"->":"Main.0.g-3"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5}],"g-3":["^What do you think of everyone? Who could it be? ",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","ev","str","^Vagie Delano","/str","/ev",{"*":".^.c-6","flg":20},{"c-6":["^ A beautiful, attractive woman. But you know, a woman can't handle such a disgusting job. They are delicate beings. Especially someone like Vagie. I don't think she's the killer.","\n",[["ev",{"^->":"Main.0.g-3.c-6.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Isn't that a very sexist approach? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Main.0.g-3.c-6.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Of course not! I'm being realistic. Thinking and being able to do such things requires the resilience and endurance unique to men.","\n",["ev","str","^Ajax Oakes","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ The doctor is a good man. Smart and perceptive. He grasps things quickly. We had conversations throughout the evening. He listened to my war stories with his mouth wide open. He liked me too. I don't think he would get involved in something like this. ","\n",["ev","str","^Cisco Choczell","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ Well, I'd say keep an eye on that guy. I can't say for sure that he did something specific, but I don't trust him. You can find his fingerprints behind anything at any moment. ","\n",["ev","str","^Urit Aalot","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ You're talking nonsense! He couldn't have committed the murder! The thought itself is ridiculous. He's the son of a respected soldier. Such a dirty job is not for him. It's just a foolish nonsense. ","\n",{"->":"Main.0.g-4"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5}],"g-4":["^Thank you, Colonel. You've been quite helpful in your own way. I'll request you to stay here until I finish examining your room. I'm sorry to say that you won't be able to enter your room until I'm done.",{"#":"speaker: Dedective"},{"#":"portrait: Dedective"},"\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}